# BuiltInFailures.ExtrusionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExtrusionFailures Class
BuiltInFailures Class Members See Also
---
Failures about Extrusions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ExtrusionFailures
```

Visual Basic
---
```text
Public NotInheritable Class ExtrusionFailures
```

Visual C++
---
```text
public ref class ExtrusionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ExtrusionFailures
# See Also
BuiltInFailures..::..ExtrusionFailures Members
Autodesk.Revit.DB Namespace